onvif/gsoap/c/ImagingBinding.SetImagingSettings.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
  xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:ns3="http://www.onvif.org/ver10/pacs"
  xmlns:xmime="http://tempuri.org/xmime.xsd"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:tt="http://www.onvif.org/ver10/schema"
  xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
  xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
  xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
  xmlns:ns1="http://www.onvif.org/ver10/actionengine/wsdl"
  xmlns:ns2="http://www.onvif.org/ver10/accesscontrol/wsdl"
  xmlns:ns4="http://www.onvif.org/ver10/doorcontrol/wsdl"
  xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl"
  xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
  xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
  xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
  xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
  xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
  xmlns:tls="http://www.onvif.org/ver10/display/wsdl"
  xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
  xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
  xmlns:trp="http://www.onvif.org/ver10/replay/wsdl"
  xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
  xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
  xmlns:tse="http://www.onvif.org/ver10/search/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <timg:SetImagingSettings>
    <timg:VideoSourceToken></timg:VideoSourceToken>
    <timg:ImagingSettings>
     <tt:BacklightCompensation>
      <tt:Mode>OFF</tt:Mode>
      <tt:Level>0.0</tt:Level>
      <!-- extensibility element(s) -->

     </tt:BacklightCompensation>
     <tt:Brightness>0.0</tt:Brightness>
     <tt:ColorSaturation>0.0</tt:ColorSaturation>
     <tt:Contrast>0.0</tt:Contrast>
     <tt:Exposure>
      <tt:Mode>AUTO</tt:Mode>
      <tt:Priority>LowNoise</tt:Priority>
      <tt:Window bottom="0.0" top="0.0" right="0.0" left="0.0"></tt:Window>
      <tt:MinExposureTime>0.0</tt:MinExposureTime>
      <tt:MaxExposureTime>0.0</tt:MaxExposureTime>
      <tt:MinGain>0.0</tt:MinGain>
      <tt:MaxGain>0.0</tt:MaxGain>
      <tt:MinIris>0.0</tt:MinIris>
      <tt:MaxIris>0.0</tt:MaxIris>
      <tt:ExposureTime>0.0</tt:ExposureTime>
      <tt:Gain>0.0</tt:Gain>
      <tt:Iris>0.0</tt:Iris>
      <!-- extensibility element(s) -->

     </tt:Exposure>
     <tt:Focus>
      <tt:AutoFocusMode>AUTO</tt:AutoFocusMode>
      <tt:DefaultSpeed>0.0</tt:DefaultSpeed>
      <tt:NearLimit>0.0</tt:NearLimit>
      <tt:FarLimit>0.0</tt:FarLimit>
      <tt:Extension>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </tt:Extension>
      <!-- extensibility element(s) -->

     </tt:Focus>
     <tt:IrCutFilter>ON</tt:IrCutFilter>
     <tt:Sharpness>0.0</tt:Sharpness>
     <tt:WideDynamicRange>
      <tt:Mode>OFF</tt:Mode>
      <tt:Level>0.0</tt:Level>
      <!-- extensibility element(s) -->

     </tt:WideDynamicRange>
     <tt:WhiteBalance>
      <tt:Mode>AUTO</tt:Mode>
      <tt:CrGain>0.0</tt:CrGain>
      <tt:CbGain>0.0</tt:CbGain>
      <tt:Extension>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </tt:Extension>
      <!-- extensibility element(s) -->

     </tt:WhiteBalance>
     <tt:Extension>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

      <tt:ImageStabilization>
       <tt:Mode>OFF</tt:Mode>
       <tt:Level>0.0</tt:Level>
       <tt:Extension>
        <!-- extensibility element(s) -->

        <!-- extensibility element(s) -->

        <!-- extensibility element(s) -->

       </tt:Extension>
       <!-- extensibility element(s) -->

      </tt:ImageStabilization>
      <tt:Extension>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </tt:Extension>
      <!-- extensibility element(s) -->

     </tt:Extension>
     <!-- extensibility element(s) -->

    </timg:ImagingSettings>
    <timg:ForcePersistence>false</timg:ForcePersistence>
   </timg:SetImagingSettings>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
