video_system/core_onvif/onvifsend/GetOptions.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
  %1
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetOptions xmlns="http://www.onvif.org/ver20/imaging/wsdl">
      <VideoSourceToken>%2</VideoSourceToken>
    </GetOptions>
  </s:Body>
</s:Envelope>