src/main/assets/setImagingSettings.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
    <s:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:mustUnderstand="1">
            <UsernameToken>
                <Username>%s</Username>
                <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">%s</Password>
                <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">%s</Nonce>
                <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">%s</Created>
            </UsernameToken>
        </Security>
    </s:Header>
<s:Body>
    <timg:SetImagingSettings>
        <timg:VideoSourceToken>%s</timg:VideoSourceToken>
        <timg:ImagingSettings>
            <tt:Brightness>%s</tt:Brightness>
        </timg:ImagingSettings>
        <timg:ForcePersistence xmlns="">true</timg:ForcePersistence>
    </timg:SetImagingSettings>
</s:Body>
</s:Envelope>