lecheng/Imaging/Get_Options.xml

Request:

POST /onvif/imaging_service HTTP/1.1
Host: 192.168.71.21
Content-Type: application/soap+xml; charset=utf-8

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tr2="http://www.onvif.org/ver20/media/wsdl" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl">
  <s:Body>
    <timg:GetOptions>
      <timg:VideoSourceToken>VideoSource000</timg:VideoSourceToken>
    </timg:GetOptions>
  </s:Body>
</s:Envelope>

Response:

HTTP/1.1 200 OK
Connection: close
Content-Length: 1024
Content-Type: application/soap+xml; charset=utf-8

<?xml version="1.0" encoding="utf-8" standalone="yes" ?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:sc="http://www.w3.org/2003/05/soap-encoding" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"><s:Body><timg:GetOptionsResponse><timg:ImagingOptions><tt:Brightness><tt:Min>0.000000</tt:Min><tt:Max>100.000000</tt:Max></tt:Brightness><tt:ColorSaturation><tt:Min>0.000000</tt:Min><tt:Max>100.000000</tt:Max></tt:ColorSaturation><tt:Contrast><tt:Min>0.000000</tt:Min><tt:Max>100.000000</tt:Max></tt:Contrast><tt:Sharpness><tt:Min>0.000000</tt:Min><tt:Max>100.000000</tt:Max></tt:Sharpness><tt:IrCutFilterModes>ON</tt:IrCutFilterModes><tt:IrCutFilterModes>OFF</tt:IrCutFilterModes><tt:IrCutFilterModes>AUTO</tt:IrCutFilterModes><tt:WideDynamicRange><tt:Mode>OFF</tt:Mode><tt:Mode>ON</tt:Mode><tt:Level><tt:Min>0.000000</tt:Min><tt:Max>100.000000</tt:Max></tt:Level></tt:WideDynamicRange></timg:ImagingOptions></timg:GetOptionsResponse></s:Body></s:Envelope>
